app/views/users/show.html.erb

SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 101], ["LIMIT", 1]]
---
  <div class="span8">
  	<% if @user.microposts.any? %>