app/controllers/microposts_controller.rb

	def create
		@micropost = current_user.microposts.build(micropost_params)
		if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "212"], ["user_id", 101], ["created_at", 2016-10-30 08:54:44 UTC], ["updated_at", 2016-10-30 08:54:44 UTC]]