app/controllers/relationships_controller.rb

	def create
		rel = Relationship.create(relation_params)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 101], ["followed_id", 2], ["created_at", 2016-11-08 03:35:53 UTC], ["updated_at", 2016-11-08 03:35:53 UTC]]

	def destroy

		rel = Relationship.find(params[:id])
		unfollowed_id = rel.followed_id

		rel.destroy
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 89], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 89]]