app/controllers/static_pages_controller.rb

  def home
    if signed_in?
      @micropost = current_user.microposts.build
      @feed = current_user.feed.paginate(page: params[:page])
---
SELECT  "microposts".* FROM "microposts" WHERE (user_id in (2,6) or user_id = 101) ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 60]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 101]]